webwork/instruction-student.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-07 Wed 22:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Instructions for students</title>
<meta name="author" content="Jang Soo Kim" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Instructions for students</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge93fa5a">1. Video instruction</a></li>
<li><a href="#org6e5045c">2. How to use webwork</a>
<ul>
<li><a href="#orgf9ecb23">2.1. Initial setup</a></li>
<li><a href="#org9e3aedb">2.2. How to view homework problems</a></li>
<li><a href="#org8e004b7">2.3. Alternative way to send homework link to TA</a></li>
</ul>
</li>
<li><a href="#org4726598">3. Contact information</a></li>
<li><a href="#org725fded">4. More information</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge93fa5a" class="outline-2">
<h2 id="orge93fa5a"><span class="section-number-2">1.</span> Video instruction</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://youtu.be/cIMMWeIUWdo">https://youtu.be/cIMMWeIUWdo</a> (in Korean)</li>
<li><a href="https://youtu.be/juxQoi3w5Og">https://youtu.be/juxQoi3w5Og</a> (in English)</li>
</ul>
</div>
</div>

<div id="outline-container-org6e5045c" class="outline-2">
<h2 id="org6e5045c"><span class="section-number-2">2.</span> How to use webwork</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf9ecb23" class="outline-3">
<h3 id="orgf9ecb23"><span class="section-number-3">2.1.</span> Initial setup</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Find your class here. <a href="https://webwork.skku.edu">https://webwork.skku.edu</a></li>
<li>Login id is your student id. (<b>Your account will be activated during the second week of the semester.</b>)</li>
<li>Initial password is your student id.</li>
<li>Click <code>User Settings</code> in the sidebar and change your password.</li>
</ol>
</div>
</div>
<div id="outline-container-org9e3aedb" class="outline-3">
<h3 id="org9e3aedb"><span class="section-number-3">2.2.</span> How to view homework problems</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Click <code>Homework Sets</code> in the sidebar. It will show you homework sets and due dates.</li>
<li>Click the homework set name that you want to view.</li>
<li>You can view problems and submit your answers here.</li>
<li>If you have questions, you can write a message to the instructor and TA by
clicking <code>Email Instructor</code>.</li>
<li>You can use various functions in your answers. Check this link: <a href="https://webwork.maa.org/wiki/Available_Functions">available functions</a></li>
<li>You can also download a pdf file of the homework problems by clicking the <code>Download PDF or TeX Hardcopy for Current Set</code> button.</li>
</ol>
</div>
</div>
<div id="outline-container-org8e004b7" class="outline-3">
<h3 id="org8e004b7"><span class="section-number-3">2.3.</span> Alternative way to send homework link to TA</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li><p>
Copy the url of the homework problem that you want to ask a question about. The url should look something like this:
</p>
<pre class="example">
https://webwork.skku.edu/webwork2/2022-1_Calculus1_GEDB001_51/hw1/1/?effectiveUser=202200001
</pre></li>
<li>Send the url to your TA by email.</li>
<li>TA should be able to see your homework problem together with your answers.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org4726598" class="outline-2">
<h2 id="org4726598"><span class="section-number-2">3.</span> Contact information</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>If you have any questions about the system, please contact the webwork TA.</li>
<li>When you write an email to the webwork TA, you must tell him/her your student id
and the class session number.</li>
</ul>
</div>
</div>

<div id="outline-container-org725fded" class="outline-2">
<h2 id="org725fded"><span class="section-number-2">4.</span> More information</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://webwork.maa.org/wiki/Student_Information">https://webwork.maa.org/wiki/Student_Information</a></li>
<li>In most problems numbers are randomly generated. So your homework problems may not be the same as your friend's.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jang Soo Kim</p>
<p class="date">Created: 2022-12-07 Wed 22:35</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
